#include<stdint.h>

/* 統一將table放在這裡，避免使用static浪費記憶體空間 
 * 如果單獨放在.h，這樣需要在前面加上static，這樣會讓所有include .h的地方都放置一份
 */


 /* 參考來源:
 *    https://en.wikibooks.org/wiki/JPEG_-_Idea_and_Practice/The_Huffman_coding
 *
 *  bits_table: 每個index代表Huffman code的bit長度(1~16)，value代表該長度的code數量
 *  hufval_table: Huffman code對應的symbol值，順序與bits_table對應
 *  例如:
 *     bits_table[0] = 0 表示沒有1 bit長度的code
 *     bits_table[1] = 2 表示有2個2 bit長度的code，分別對應hufval_table前面2個symbol
 *     bits_table[2] = 1 表示有1個3 bit長度的code，對應hufval_table的第3個symbol
 */

// Y: dc 
const uint8_t jpeg_dc_luminance_huffman_bits_table[16] = {0, 1, 5, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0};
const uint8_t jpeg_dc_luminance_huffman_hufval_table[12] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11};
// UV: dc
const uint8_t jpeg_dc_chrominance_huffman_bits_table[16] = {0, 3, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0};
const uint8_t jpeg_dc_chrominance_huffman_hufval_table[12] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11};
// Y: ac
const uint8_t jpeg_ac_luminance_huffman_bits_table[16] = {0, 2, 1, 3, 3, 2, 4, 3, 5, 5, 4, 4, 0, 0, 1, 125};
const uint8_t jpeg_ac_luminance_huffman_hufval_table[] = {
      1,  2,  3,  0,  4, 17,  5, 18, 33, 49, 65,  6, 19, 81, 97,  7, 34,113, 20, 50, 
    129,145,161,  8, 35, 66,177,193, 21, 82,209,240, 36, 51, 98,114,130,  9, 10, 22, 
     23, 24, 25, 26, 37, 38, 39, 40, 41, 42, 52, 53, 54, 55, 56, 57, 58, 67, 68, 69, 
     70, 71, 72, 73, 74, 83, 84, 85, 86, 87, 88, 89, 90, 99,100,101,102,103,104,105,
    106,115,116,117,118,119,120,121,122,131,132,133,134,135,136,137,138,146,147,148,
    149,150,151,152,153,154,162,163,164,165,166,167,168,169,170,178,179,180,181,182,
    183,184,185,186,194,195,196,197,198,199,200,201,202,210,211,212,213,214,215,216,
    217,218,225,226,227,228,229,230,231,232,233,234,241,242,243,244,245,246,247,248, 
    249,250
};
//UV: ac
const uint8_t jpeg_ac_chrominance_huffman_bits_table[16] = {0, 2, 1, 2, 4, 4, 3, 4, 7, 5, 4, 4, 0, 1, 2, 119};
const uint8_t jpeg_ac_chrominance_huffman_hufval_table[] = {
      0,  1,  2,  3, 17,  4,  5, 33, 49,  6, 18, 65, 81,  7, 97,113, 19, 34, 50,129,
      8, 20, 66,145,161,177,193,  9, 35, 51, 82,240, 21, 98,114,209, 10, 22, 36, 52,
    225, 37,241, 23, 24, 25, 26, 38, 39, 40, 41, 42, 53, 54, 55, 56, 57, 58, 67, 68,
     69, 70, 71, 72, 73, 74, 83, 84, 85, 86, 87, 88, 89, 90, 99,100,101,102,103,104,
    105,106,115,116,117,118,119,120,121,122,130,131,132,133,134,135,136,137,138,146,
    147,148,149,150,151,152,153,154,162,163,164,165,166,167,168,169,170,178,179,180,
    181,182,183,184,185,186,194,195,196,197,198,199,200,201,202,210,211,212,213,214,
    215,216,217,218,226,227,228,229,230,231,232,233,234,242,243,244,245,246,247,248,
    249,250
};