#include<stdint.h>

/* 統一將table放在這裡，避免使用static浪費記憶體空間 
 * 如果單獨放在.h，這樣需要在前面加上static，這樣會讓所有include .h的地方都放置一份
 */

/* JPEG量化表 
*  來源: https://www.sciencedirect.com/topics/computer-science/quantization-table
*/ 
const uint8_t jpeg_luminance_quant_table[64] = {
    16, 11, 10, 16, 24, 40, 51, 61,
    12, 12, 14, 19, 26, 58, 60, 55,
    14, 13, 16, 24, 40, 57, 69, 56,
    14, 17, 22, 29, 51, 87, 80, 62,
    18, 22, 37, 56, 68,109,103, 77,
    24, 35, 55, 64, 81,104,113, 92,
    49, 64, 78, 87,103,121,120,101,
    72, 92, 95, 98,112,100,103, 99
};
const uint8_t jpeg_chrominance_quant_table[64] = {
    17, 18, 24, 47, 99, 99, 99, 99,
    18, 21, 26, 66, 99, 99, 99, 99,
    24, 26, 56, 99, 99, 99, 99, 99,
    47, 66, 99, 99, 99, 99, 99, 99,
    99, 99, 99, 99, 99, 99, 99, 99,
    99, 99, 99, 99, 99, 99, 99, 99,
    99, 99, 99, 99, 99, 99, 99, 99,
    99, 99, 99, 99, 99, 99, 99, 99
};
